In [1]:
print("vikas")
import pandas as pd
import numpy as np

vikas

In [2]:
data=pd.read_csv("titanictrain.csv")
testdata=pd.read_csv("titanictest.csv")
from sklearn.preprocessing import LabelEncoder 
le=LabelEncoder()
testdata["Sex"]=le.fit_transform(testdata["Sex"])
testdata=testdata.fillna(testdata["Age"].mean())
testdata.head()
print(testdata.shape)

(418, 11)

In [3]:
print(data.shape)
print(testdata.shape)

(891, 12)
(418, 11)

In [4]:
data.info()
data.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# preprocessing of data

In [5]:
dropcolumn=["Name","Embarked","Cabin","Ticket","PassengerId"]
newdata=data.drop(dropcolumn,axis=1)
newdata.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0         0       3    male  22.0      1      0   7.2500
1         1       1  female  38.0      1      0  71.2833
2         1       3  female  26.0      0      0   7.9250
3         1       1  female  35.0      1      0  53.1000
4         0       3    male  35.0      0      0   8.0500

In [6]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
newdata["Sex"]=le.fit_transform(newdata["Sex"])
newdata=newdata.fillna(newdata["Age"].mean())
newdata.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0         0       3    1  22.0      1      0   7.2500
1         1       1    0  38.0      1      0  71.2833
2         1       3    0  26.0      0      0   7.9250
3         1       1    0  35.0      1      0  53.1000
4         0       3    1  35.0      0      0   8.0500

In [7]:
testdata.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,30.2726,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,30.2726,S
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,30.2726,Q
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,30.2726,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,30.2726,S

In [8]:
newdata1=data.drop(dropcolumn,axis=1)
newdata1.set_index("Survived",inplace=True)
newdata1.head()

          Pclass     Sex   Age  SibSp  Parch     Fare
Survived
0              3    male  22.0      1      0   7.2500
1              1  female  38.0      1      0  71.2833
1              3  female  26.0      0      0   7.9250
1              1  female  35.0      1      0  53.1000
0              3    male  35.0      0      0   8.0500

In [9]:
input1=["Sex","Age","SibSp","Fare","Parch","Pclass"]
output=["Survived"]
X=newdata[input1]
Y=newdata[output]

# decision tree using sklearn

In [10]:
from sklearn.tree import DecisionTreeClassifier
tree=DecisionTreeClassifier(criterion='entropy',max_depth=5)
tree.fit(X,Y)
result=tree.predict(testdata[input1])

In [11]:
tree.score(X,Y)

0.8473625140291807

In [12]:
print(result)

[0 0 0 0 1 0 1 0 1 0 0 0 1 0 1 1 0 0 1 0 0 1 1 0 1 0 1 0 0 0 0 0 1 0 0 0 1
 1 0 0 0 0 0 1 1 0 0 0 1 1 0 0 1 1 0 0 0 0 0 1 0 0 0 1 1 1 1 0 0 1 1 0 1 0
 1 0 0 1 0 1 1 0 0 0 0 0 1 1 1 1 1 0 1 0 0 0 1 0 1 0 1 0 0 0 1 0 0 0 0 0 0
 1 1 1 1 0 0 1 0 1 1 0 1 0 0 1 0 1 0 0 0 0 0 0 0 0 0 0 1 0 0 1 0 0 0 0 0 0
 0 0 1 0 0 1 0 0 1 1 0 1 1 1 1 0 0 1 0 0 1 1 0 0 0 0 0 1 1 0 1 1 0 0 1 0 1
 0 1 0 0 0 0 0 0 0 1 0 1 1 0 1 1 1 0 1 0 0 1 0 1 0 0 0 0 1 0 0 1 0 1 0 1 0
 1 0 1 1 0 1 0 0 0 1 0 0 0 0 0 0 1 1 1 1 0 0 0 0 1 0 1 1 1 0 0 0 0 0 0 0 1
 0 0 0 1 1 0 0 0 0 1 0 0 0 1 1 0 1 0 0 0 0 1 1 1 1 1 0 0 0 0 0 0 1 0 0 0 0
 0 0 0 0 0 0 0 0 1 1 0 1 0 0 0 0 0 0 1 1 0 0 0 0 0 0 0 0 1 0 1 0 0 0 1 0 0
 1 0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 1 1 0 0 0 1 0 1 0 0 1 0 1 1 0 1 0 0 1 1 0
 0 1 0 0 1 1 1 0 0 0 0 0 1 1 0 1 0 0 0 0 0 1 0 0 0 1 0 1 0 0 1 0 1 0 0 0 0
 0 1 1 1 1 1 0 1 0 0 0]

In [13]:
print("vikas") #lets get started

vikas

In [18]:
print(-(9/14)*np.log2(9/14)-(5/14)*np.log2(5/14))

0.9402859586706311